---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarHooksDontMatchShape
source: html/fc9601c1-64a5-dde1-e06e-c5481b360cc9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarHooksDontMatchShape Property

The Rebar's hooks do not match its Rebar Shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarHooksDontMatchShape { get; }
```